rails-backend/app/controllers/application_controller.rb

    def current_user
        token = request.headers['Auth-Key']
        begin
            user_id = JWT.decode(token,'SUPER_SECRET_KEY')[0]["user_id"]
            @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]