rails-backend/app/controllers/channel_members_controller.rb

SELECT "channel_members".* FROM "channel_members"
---
    def index
        channel_members = ChannelMember.all

SELECT "channel_members".* FROM "channel_members" WHERE "channel_members"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        channel_member = ChannelMember.find_by(id: params[:id])