rails-backend/app/controllers/channels_controller.rb

    def index
        channels = Channel.all
---
SELECT "channels".* FROM "channels"

    def show
        channel = Channel.find_by(id: params[:id])
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]