rails-backend/app/controllers/channel_owners_controller.rb

    def index
        channel_owners = ChannelOwner.all
---
SELECT "channel_owners".* FROM "channel_owners"

    def show
        channel_owner = ChannelOwner.find_by(id: params[:id])
---
SELECT "channel_owners".* FROM "channel_owners" WHERE "channel_owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]