rails-backend/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes"
---
    def index
        likes = Like.all

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        like = Like.find_by(id: params[:id])