rails-backend/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
    def index
        posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        post = Post.find_by(id: params[:id])

INSERT INTO "posts" ("user_id", "title", "content", "postable_type", "postable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        authenticate!
        post = Post.new(post_params)
        post.user_id = current_user.id
        if post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Yo Yo Yo!"], ["updated_at", "2021-01-18 17:15:55.800690"], ["id", 22]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
    def update
        authenticate!
        post = Post.find(params[:id])
        if post.user_id == current_user.id
            post.update_attributes(post_params)
            post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 22]]
---
    def destroy
        Post.destroy(params[:id])