rails-backend/app/controllers/users_controller.rb

    def create
        @user = User.create(users_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)